import { selectOptionsType } from '../modules/shared/select/select.model'

export class ClassificatorSelectOptions {
  static get regions(): selectOptionsType {
    return [
      { id: '7700000000000', name: 'Москва (г)' },
      { id: '7800000000000', name: 'Санкт-Петербург (г)' },
      { id: '0100000000000', name: 'Адыгея (Респ)' },
      { id: '0400000000000', name: 'Алтай (Респ)' },
      { id: '2200000000000', name: 'Алтайский (край)' },
      { id: '2800000000000', name: 'Амурская (обл)' },
      { id: '2900000000000', name: 'Архангельская (обл)' },
      { id: '3000000000000', name: 'Астраханская (обл)' },
      { id: '9900000000000', name: 'Байконур (г)' },
      { id: '0200000000000', name: 'Башкортостан (Респ)' },
      { id: '3100000000000', name: 'Белгородская (обл)' },
      { id: '3200000000000', name: 'Брянская (обл)' },
      { id: '0300000000000', name: 'Бурятия (Респ)' },
      { id: '3300000000000', name: 'Владимирская (обл)' },
      { id: '3400000000000', name: 'Волгоградская (обл)' },
      { id: '3500000000000', name: 'Вологодская (обл)' },
      { id: '3600000000000', name: 'Воронежская (обл)' },
      { id: '0500000000000', name: 'Дагестан (Респ)' },
      { id: '7900000000000', name: 'Еврейская (Аобл)' },
      { id: '7500000000000', name: 'Забайкальский (край)' },
      { id: '3700000000000', name: 'Ивановская (обл)' },
      { id: '0600000000000', name: 'Ингушетия (Респ)' },
      { id: '3800000000000', name: 'Иркутская (обл)' },
      { id: '0700000000000', name: 'Кабардино-Балкарская (Респ)' },
      { id: '3900000000000', name: 'Калининградская (обл)' },
      { id: '0800000000000', name: 'Калмыкия (Респ)' },
      { id: '4000000000000', name: 'Калужская (обл)' },
      { id: '4100000000000', name: 'Камчатский (край)' },
      { id: '0900000000000', name: 'Карачаево-Черкесская (Респ)' },
      { id: '1000000000000', name: 'Карелия (Респ)' },
      { id: '4200000000000', name: 'Кемеровская область - Кузбасс (обл)' },
      { id: '4300000000000', name: 'Кировская (обл)' },
      { id: '1100000000000', name: 'Коми (Респ)' },
      { id: '4400000000000', name: 'Костромская (обл)' },
      { id: '2300000000000', name: 'Краснодарский (край)' },
      { id: '2400000000000', name: 'Красноярский (край)' },
      { id: '9100000000000', name: 'Крым (Респ)' },
      { id: '4500000000000', name: 'Курганская (обл)' },
      { id: '4600000000000', name: 'Курская (обл)' },
      { id: '4700000000000', name: 'Ленинградская (обл)' },
      { id: '4800000000000', name: 'Липецкая (обл)' },
      { id: '4900000000000', name: 'Магаданская (обл)' },
      { id: '1200000000000', name: 'Марий Эл (Респ)' },
      { id: '1300000000000', name: 'Мордовия (Респ)' },
      { id: '5000000000000', name: 'Московская (обл)' },
      { id: '5100000000000', name: 'Мурманская (обл)' },
      { id: '8300000000000', name: 'Ненецкий (АО)' },
      { id: '5200000000000', name: 'Нижегородская (обл)' },
      { id: '5300000000000', name: 'Новгородская (обл)' },
      { id: '5400000000000', name: 'Новосибирская (обл)' },
      { id: '5500000000000', name: 'Омская (обл)' },
      { id: '5600000000000', name: 'Оренбургская (обл)' },
      { id: '5700000000000', name: 'Орловская (обл)' },
      { id: '5800000000000', name: 'Пензенская (обл)' },
      { id: '5900000000000', name: 'Пермский (край)' },
      { id: '2500000000000', name: 'Приморский (край)' },
      { id: '6000000000000', name: 'Псковская (обл)' },
      { id: '6100000000000', name: 'Ростовская (обл)' },
      { id: '6200000000000', name: 'Рязанская (обл)' },
      { id: '6300000000000', name: 'Самарская (обл)' },
      { id: '6400000000000', name: 'Саратовская (обл)' },
      { id: '1400000000000', name: 'Саха /Якутия/ (Респ)' },
      { id: '6500000000000', name: 'Сахалинская (обл)' },
      { id: '6600000000000', name: 'Свердловская (обл)' },
      { id: '9200000000000', name: 'Севастополь (г)' },
      { id: '1500000000000', name: 'Северная Осетия - Алания (Респ)' },
      { id: '6700000000000', name: 'Смоленская (обл)' },
      { id: '2600000000000', name: 'Ставропольский (край)' },
      { id: '6800000000000', name: 'Тамбовская (обл)' },
      { id: '1600000000000', name: 'Татарстан (Респ)' },
      { id: '6900000000000', name: 'Тверская (обл)' },
      { id: '7000000000000', name: 'Томская (обл)' },
      { id: '7100000000000', name: 'Тульская (обл)' },
      { id: '1700000000000', name: 'Тыва (Респ)' },
      { id: '7200000000000', name: 'Тюменская (обл)' },
      { id: '1800000000000', name: 'Удмуртская (Респ)' },
      { id: '7300000000000', name: 'Ульяновская (обл)' },
      { id: '2700000000000', name: 'Хабаровский (край)' },
      { id: '1900000000000', name: 'Хакасия (Респ)' },
      { id: '8600000000000', name: 'Ханты-Мансийский Автономный округ - Югра (АО)' },
      { id: '7400000000000', name: 'Челябинская (обл)' },
      { id: '2000000000000', name: 'Чеченская (Респ)' },
      { id: '2100000000000', name: 'Чувашская Республика - (Чувашия)' },
      { id: '8700000000000', name: 'Чукотский (АО)' },
      { id: '8900000000000', name: 'Ямало-Ненецкий (АО)' },
      { id: '7600000000000', name: 'Ярославская (обл)' },
    ]
  }

  static get education(): selectOptionsType {
    return [
      { id: 'Higher', name: 'Высшее' },
      { id: 'Two or More Higher', name: 'Два и более высших' },
      { id: 'Primary', name: 'Начальное, неполное среднее' },
      { id: 'Incomplete Higher', name: 'Неполное высшее' },
      { id: 'Secondary', name: 'Среднее или специальное' },
      { id: 'Degree', name: 'Ученая степень' },
    ]
  }

  static get companyView(): selectOptionsType {
    return [
      { id: 'Transportation', name: 'Авиа-, авто-, жд перевозки' },
      { id: 'Lawyers', name: 'Адвокаты' },
      { id: 'Administrarive Services', name: 'Административно-хоз. службы' },
      { id: 'Water/Heat/Electricity', name: 'Водо-, тепло-, энергоснабжение' },
      { id: 'Armed Forces', name: 'Вооруженные силы' },
      { id: 'Mining/Energy', name: 'Горнодобывающая пром-ть/ ТЭК' },
      { id: 'Hotels/Public Catering', name: 'Гостиницы/ общепиты' },
      { id: 'Government', name: 'Государственное управление' },
      { id: 'Social Assistance', name: 'Здравоохранение, соц.помощь' },
      { id: 'Gambling Industry', name: 'Игорный бизнес' },
      { id: 'Entertainment', name: 'Искусство, развлечения, отдых' },
      { id: 'Scientific Activity', name: 'Научная деятельность' },
      { id: 'Notaries', name: 'Нотариусы' },
      { id: 'Education', name: 'Образование' },
      { id: 'Wholesale', name: 'Оптовая торговля' },
      { id: 'Security Service', name: 'Охранная деятельность' },
      { id: 'Entrepreneurship', name: 'Предпринимательская деят-ть' },
      { id: 'Service Industries', name: 'Предприятия сферы услуг' },
      { id: 'Mass Media', name: 'Пресса, телевидение и радио' },
      { id: 'Arms Trade', name: 'Промышленность/машиностроение' },
      { id: 'Mechanical Engineering', name: 'Риелторские услуги' },
      { id: 'Real Estate Services', name: 'Розничная торговля' },
      { id: 'Retail', name: 'Сельское хозяйство' },
      { id: 'Agriculture', name: 'Строительство' },
      { id: 'Speculation and Investment', name: 'Управление компаниями' },
      { id: 'Construction', name: 'Финансовое дело и страхование' },
      { id: 'Tobaccoo Business', name: 'Юридические услуги' },
    ]
  }

  static get familyStatus(): selectOptionsType {
    return [
      { id: 'Married Status', name: 'Женат/Замужем' },
      { id: 'Single Status', name: 'Холост/не замужем' },
      { id: 'Divorced', name: 'Разведен/разведена' },
      { id: 'Widowed', name: 'Вдова/вдовец' },
      { id: 'Civil Marriage', name: 'Живем вместе' },
    ]
  }

  static get typeWork(): selectOptionsType {
    return [
      { id: 'Job', name: 'Работа по трудовому договору' },
      { id: 'Military', name: 'Военный' },
      { id: 'Homemaker/Decree', name: 'Домохозяйка/Декрет' },
      { id: 'Not Working', name: 'Не работает' },
      { id: 'Informal Work/Temporary jobs', name: 'Неофициальная работа' },
      { id: 'Pensioner', name: 'Неработающий пенсионер' },
      { id: 'Work', name: 'Работа по временному контракту' },
      { id: 'Working Pensioner', name: 'Работающий пенсионер' },
      { id: 'Student', name: 'Студент' },
    ]
  }

  static getContactsStatus(isMarried = true): selectOptionsType {
    const result = [
      { id: 'Parent', name: 'Родитель' },
      { id: 'Relative', name: 'Родственник' },
    ]

    if (isMarried) {
      result.push({ id: 'Spouse', name: 'Супруг' })
    }

    return result
  }
}
